; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared0 - mode
	spectrograph2 - mode
	thermograph1 - mode
	spectrograph3 - mode
	Star5 - direction
	Star4 - direction
	Star2 - direction
	Star1 - direction
	Star6 - direction
	Star3 - direction
	GroundStation7 - direction
	GroundStation0 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star3)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation7)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Phenomenon11)
	(have_image Star8 spectrograph3)
	(have_image Phenomenon9 spectrograph2)
	(have_image Star10 infrared0)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon12 spectrograph2)
	(have_image Phenomenon13 infrared0)
	(have_image Star14 spectrograph2)
))

)

; plan
1. (turn_to satellite0 star1 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star1)
   goals met: 0 of 9
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite0 star8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star8)
   goals met: 0 of 9
5. (take_image satellite0 star8 instrument2 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 1 of 9
6. (turn_to satellite0 star1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star1)
   goals met: 1 of 9
7. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 9
8. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 9
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 9
10. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 1 of 9
11. (turn_to satellite0 phenomenon11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 9
12. (take_image satellite0 phenomenon11 instrument1 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 2 of 9
13. (turn_to satellite0 groundstation0 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 9
14. (turn_to satellite1 star3 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star3)
   goals met: 3 of 9
15. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 3 of 9
16. (turn_to satellite1 phenomenon12 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 9
17. (take_image satellite1 phenomenon12 instrument3 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 4 of 9
18. (turn_to satellite1 phenomenon13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon13)
   goals met: 4 of 9
19. (take_image satellite1 phenomenon13 instrument3 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 5 of 9
20. (turn_to satellite1 phenomenon9 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon9)
   goals met: 5 of 9
21. (take_image satellite1 phenomenon9 instrument3 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 6 of 9
22. (turn_to satellite1 star10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star10)
   goals met: 6 of 9
23. (take_image satellite1 star10 instrument3 infrared0)
   added: (have_image star10 infrared0)
   goals met: 7 of 9
24. (turn_to satellite1 star14 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star14)
   goals met: 7 of 9
25. (take_image satellite1 star14 instrument3 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 8 of 9
26. (turn_to satellite1 phenomenon11 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 phenomenon11)
   goals met: 9 of 9
